{"draft":"draft-ietf-madinas-use-cases-19","doc_id":"RFC9797","title":"Randomized and Changing Media Access Control (MAC) Addresses: Context, Network Impacts, and Use Cases","authors":["J. Henry","Y. Lee"],"format":["HTML","TEXT","PDF","XML"],"page_count":"17","pub_status":"INFORMATIONAL","status":"INFORMATIONAL","source":"MAC Address Device Identification for Network and Application Services","abstract":"To limit the privacy issues created by the association between a\r\ndevice, its traffic, its location, and its user in IEEE 802 networks,\r\nclient vendors and client OS vendors have started implementing Media\r\nAccess Control (MAC) address randomization. This technology is\r\nparticularly important in Wi-Fi networks (defined in IEEE 802.11) due\r\nto the over-the-air medium and device mobility. When such\r\nrandomization happens, some in-network states may break, which may\r\naffect network connectivity and user experience.  At the same time,\r\ndevices may continue using other stable identifiers, defeating the\r\npurpose of MAC address randomization.\r\n\r\nThis document lists various network environments and a range of\r\nnetwork services that may be affected by such randomization. This\r\ndocument then examines settings where the user experience may be\r\naffected by in-network state disruption. Last, this document examines\r\nsome existing frameworks that maintain user privacy while preserving\r\nuser quality of experience and network operation efficiency.","pub_date":"June 2025","keywords":["RCM","Universal MAC address","Local MAC address","Locally Administered MAC address","Personal Device","Shared Service Device","Network Functional Entities","Human-Related Entities","Over-the-Air (OTA) observers","Wireless access network operators","Network access providers","Over-the-Wired internal (OTWi) observers","Over-the-Wired external (OTWe) observers","full trust","selective trust","zero trust","privacy","Residential settings","Managed residential settings","public guest network","Enterprises with Bring-Your-Own-Device (BYOD)","Managed Enterprises"],"obsoletes":[],"obsoleted_by":[],"updates":[],"updated_by":[],"see_also":[],"doi":"10.17487\/RFC9797","errata_url":null}